clients_list = [
    ('Иванов Илья', '+375291345244'), 
    ('Смирнов Сергей', '+375331374854'), 
    ('Кузнецова Ольга', '+375297842344'),
    ('Попов Олег', '+375444144567'),
    ('Васильев Александр', '+375294343255'),
    ('Петров Алексей', '+375433232478'),
    ('Михайлова Анна', '+375543245465'),
]

services_list = [
    ('Классический массаж всего тела 30/60/90/120 мин', 200.00),
    ('Расслабляющий массаж на все тело с элементами тайских техник 30/60/90/120 мин.', 1126.00),
    ('Расслабляющий массаж на все тело с элементами балийских техник 30/60/90/120 мин.', 690.00),
    ('Расслабляющий массаж на все тело с элементами индийских техник 30/60/90/120 мин.', 434.19),
    ('Антицеллюлитный массаж (живот, бедра) 30/60/90/120 мин.', 617.13),
    ('Лимфодренажный массаж 30/60/90/120 мин.', 891.77),
    ('Массаж отдельных зон', 265.41),
]

orders_list = [
    (7, 'Классический массаж всего тела 30/60/90/120 мин'),
    (4, 'Расслабляющий массаж на все тело с элементами индийских техник 30/60/90/120 мин.'),
    (7, 'Массаж отдельных зон'),
    (1, 'Лимфодренажный массаж 30/60/90/120 мин.'),
    (3, 'Антицеллюлитный массаж (живот, бедра) 30/60/90/120 мин.'),
]